{
  "intents": [
  {
    "tag": "greeting",
    "patterns": [
      "hi",
      "hello",
      "hey",
      "hi there",
      "hello there",
      "hey there",
      "good morning",
      "good afternoon",
      "good evening",
      "greetings",
      "yo",
      "wassup",
      "heyy",
      "Yo",
      "hey hey"
    ],

    "responses": [
        "Hi, how can I help you today?",
        "Hello, what can I do for you?",
        "Hey, how can I assist you?",
        "Hi there, what would you like to know?",
        "Hello, I am here if you need anything.",
        "Hey, how can I support you today?",
        "Hi, I am your FitTrack Assistant. How can I help?",
        "Hello, feel free to ask me anything.",
        "Hi, let me know how I can assist you.",
        "Hello, how may I assist you?"
    ]
    },

    {
      "tag": "order_id",
      "patterns": [

        "Where is my order ID?",
        "Where can I find my order ID?",
        "How do I find my order ID?",
        "Why can't I find my order ID?",
        "Why did I not receive my order ID?",
        "Why didn’t I get my order ID?",
        "Why is my order ID missing?",
        "How do I view my order ID?",
        "Which email contains my order ID?",
        "Where is the email with my order ID?",
        "How can I locate my order ID?",
        "Where does the system show my order ID?",
        "Is my order ID shown on the success page?",
        "Where should my order ID appear?",
        "How can I check my order ID after payment?",
        "Did I receive an order ID after purchasing?",
        "Where does my order ID appear after payment?",
        "Where do I see the order ID in my email?",
        "Can you tell me where my order ID is located?",
        "Where was the order ID displayed?",
        "How do I know what my order ID is?",
        "Which page displays the order ID after payment?",
        "Where in the confirmation email is my order ID?",
        "How do I confirm my order ID?",
        "What should I check to find my order ID?",
        "How do I retrieve my order ID?",
        "Where was the order ID supposed to appear?",
        "Where can I see the order ID you provide?",
        "Did the order ID appear on the success screen?",
        "How can I identify my order ID?",
        "I need my order ID",
        "My order ID is missing",
        "I did not receive my order ID",
        "I cannot find my order ID anywhere",
        "My order ID should be in the email",
        "My order ID did not show up",
        "I want to see my order ID",
        "I need help finding my order ID",
        "I want to locate my order ID",
        "My order ID is not appearing",
        "I want to know my order ID",
        "order id",
        "order id help",
        "order id not found",
        "order id missing",
        "lost order id",
        "find order id",
        "see order id",
        "lookup order id",
        "order id email",
        "payment order id",
        "fittrack order id",
        "paypal order id",
        "order id info",
        "order id where",
        "cant find order id",
        "didnt get order id",
        "order number",
        "where is my order number?",
        "lost my order number",
        "need order number",
        "order id",
        "order-id",
        "order reference",
        "purchase id",
        "id for my order",
        "transaction order id",
        "order id issue",
        "order id problem"
      ],

      "responses": [
        "You can find your Order ID on the payment success page immediately after your purchase.",
        "Your Order ID is included in the automated email sent to the PayPal account you used during checkout.",
        "Please check the confirmation email sent after payment. Your Order ID is listed there.",
        "The Order ID appears both on the success page and in the confirmation email you receive after completing your purchase."
      ]
    },


    {
      "tag": "payment_receipt_missing",
      "patterns": [

        "I did not receive my receipt",
        "I didn't get a receipt",
        "Why did I not receive a receipt?",
        "Why didn't I get a payment receipt?",
        "Why is my receipt missing?",
        "My payment receipt never arrived",
        "Where is my receipt email? It didn't come",
        "The receipt email never came",
        "The payment receipt was not sent to me",
        "I paid but received no receipt",
        "I completed the payment but got no receipt",
        "I never got the receipt from PayPal",
        "My receipt email did not arrive",
        "Why did PayPal not send me a receipt?",
        "I can't find my receipt email anywhere",
        "My receipt is missing",
        "No receipt was sent to my email",
        "The system didn't send me a receipt",
        "I checked my email and there is no receipt",
        "My email has no receipt",
        "The receipt should be in my inbox but it's not",
        "I want to know why I didn't receive a receipt",
        "My receipt is not showing up",
        "The receipt email didn't show up",
        "It says a receipt was sent but I didn't get it",
        "I need help with a missing receipt",
        "I need support because my receipt never arrived",
        "My receipt didn't come",
        "I want to report that my receipt is missing",
        "The payment receipt is missing",
        "I have no receipt email",
        "My receipt was not delivered",
        "missing receipt",
        "receipt not sent",
        "receipt email missing",
        "paypal receipt missing",
        "receipt not received",
        "lost receipt email",
        "receipt issue",
        "receipt problem",
        "no receipt email",
        "didnt get receipt",
        "cant find receipt",
        "receipt never came",
        "no paypal receipt",
        "receipt failed",
        "payment receipt missing"
      ],

      "responses": [
        "If your receipt did not arrive, please contact the FitTrack support team through the contact page and explain that your PayPal receipt email was not delivered.",
        "A missing receipt usually means the confirmation email was blocked or delayed. Please reach out to the support team and mention that the receipt email is missing.",
        "If PayPal did not send you a receipt email, contact the support team via the contact page and let them know you never received your payment receipt.",
        "Please use the contact page to notify the support team that the payment receipt was not sent to your email."
      ]
    },


    {
      "tag": "payment_success",
      "patterns": [

        "Did my payment go through?",
        "Was my payment successful?",
        "How do I know if my payment was successful?",
        "How do I confirm that the payment worked?",
        "How can I check if the payment was completed?",
        "Did the system receive my payment?",
        "Did the website accept my payment?",
        "How do I verify my payment status?",
        "Where do I see the payment confirmation?",
        "Where is the payment success page?",
        "How do I find the payment success page?",
        "Did the payment process finish correctly?",
        "Did my PayPal payment go through?",
        "Was my PayPal transaction successful?",
        "Where can I see confirmation of my payment?",
        "Where does the website show successful payments?",
        "How do I know if my purchase is complete?",
        "How do I check if my membership is activated?",
        "Did my membership activate after paying?",
        "Where is the confirmation screen after payment?",
        "Did I land on the payment success page?",
        "Why didn’t I see the payment success page?",
        "I want to check my payment",
        "I need to confirm my payment",
        "I want to know if my payment was successful",
        "My payment should be successful",
        "I paid but I am not sure if it went through",
        "I want to verify my payment status",
        "I need payment confirmation",
        "I want to see the payment confirmation page",
        "I think my payment went through",
        "I want to make sure the payment worked",
        "payment success",
        "payment confirmation",
        "payment went through",
        "successful payment",
        "payment accepted",
        "payment complete",
        "payment done",
        "paypal payment success",
        "transaction complete",
        "purchase completed",
        "membership activated",
        "payment status",
        "check payment",
        "verify payment",
        "confirm payment",
        "payment screen",
        "payment success page"
      ],

      "responses": [
        "Your payment is successful if you reached the payment success page after checkout.",
        "Once the payment is completed, you are automatically redirected to the payment success page with your order ID.",
        "If your payment went through, you should see the payment success screen and also receive a confirmation email from PayPal.",
        "A successful payment always leads to the payment success page and a PayPal confirmation email sent to your account."
      ]
    },


    {
      "tag": "reduce_calories",
      "patterns": [

        "How can I reduce my calories today?",
        "How do I lower my calorie intake?",
        "What can I do to eat fewer calories?",
        "How can I cut calories without feeling hungry?",
        "How can I avoid eating too many calories?",
        "What are effective ways to reduce calories?",
        "How do I eat less during the day?",
        "How can I avoid unnecessary calories?",
        "How do I stay under my calorie limit?",
        "How do I stay under my calorie goal?",
        "How can I lower my calories each day?",
        "How do I stop overeating?",
        "How can I prevent binge eating?",
        "How do I reduce my appetite?",
        "How can I reduce calories without starving?",
        "What should I do if I want to eat fewer calories?",
        "How can I avoid high calorie foods?",
        "How can I lower my daily calorie consumption?",
        "How do I cut back on calories?",
        "What habits help reduce calories?",
        "How do I reduce calories for weight loss?",
        "What can I change to reduce calories?",
        "How can I reduce calorie intake at night?",
        "How can I eat less but still feel full?",
        "What is the easiest way to reduce calories?",
        "How do I reduce calories when dieting?",
        "How can I stay in a calorie deficit?",
        "How do I stop eating junk food?",
        "How do I avoid snacking too much?",
        "How do I control my calorie intake?",
        "I want to reduce my calories",
        "I need to lower my calorie intake",
        "I want to eat fewer calories",
        "I want to control my calories",
        "I need to cut calories",
        "I want to stay in a calorie deficit",
        "I want to avoid extra calories",
        "I want to stop overeating",
        "I want to keep my calories low",
        "I need to avoid high calorie foods",
        "reduce calories",
        "cut calories",
        "lower calories",
        "eat fewer calories",
        "avoid calories",
        "calorie control",
        "too many calories",
        "reduce calorie intake",
        "calorie deficit help",
        "stop overeating",
        "eat less",
        "calories too high",
        "lower daily calories",
        "how to reduce calories",
        "reduce calorie tips",
        "low calorie habits",
        "cutting calories",
        "reduce food intake"
      ],

      "responses": [
        "You can reduce calories by choosing low-calorie, high-volume foods such as vegetables, salads, lean meats, eggs, and Greek yogurt. Drinking water before meals helps as well.",
        "To cut calories, focus on lean proteins, vegetables, and fiber-rich foods. Avoid sugary drinks, processed snacks, and large portions.",
        "A simple way to reduce calories is to replace high-calorie foods with lighter alternatives, eat slower, and avoid late-night snacking.",
        "Increasing protein and fiber helps you feel full and naturally reduces calorie intake without feeling deprived."
      ]
    },


    {
      "tag": "foods_weight_loss",
      "patterns": [

        "Which foods are good for weight loss?",
        "What should I eat to lose weight?",
        "What are the best foods for weight loss?",
        "What foods help reduce weight?",
        "What foods help burn fat?",
        "Which foods help with fat loss?",
        "What foods make weight loss easier?",
        "What are low calorie foods for weight loss?",
        "What should I eat when trying to lose weight?",
        "What foods support weight loss?",
        "Which foods keep calories low?",
        "What foods keep you full while losing weight?",
        "What foods help with dieting?",
        "What is the best food to eat for weight loss?",
        "What healthy foods help with weight reduction?",
        "What meals are good for losing weight?",
        "What should I add to my diet to lose weight?",
        "What foods are effective for fat loss?",
        "What should I eat during a weight loss diet?",
        "What foods make dieting easier?",
        "I want to lose weight, what should I eat",
        "I need foods that help with weight loss",
        "I want foods that help burn fat",
        "I want food options for losing weight",
        "I want healthier foods for weight loss",
        "I need better food choices for weight loss",
        "I want meals that help me lose weight",
        "I want snacks that help me lose weight",
        "I want to know which foods help with fat loss",
        "I need foods that support weight loss",
        "weight loss foods",
        "foods for weight loss",
        "fat loss foods",
        "healthy foods weight loss",
        "best foods weight loss",
        "foods to lose weight",
        "food to burn fat",
        "diet foods",
        "low calorie foods weight loss",
        "foods to cut weight",
        "foods for dieting",
        "weight reducer foods",
        "foods good for losing weight",
        "weight loss diet foods",
        "food for fat burning"
      ],

      "responses": [
        "Good foods for weight loss include eggs, chicken breast, fish, Greek yogurt, vegetables, fruits, oats, beans, and leafy salads. These keep you full with fewer calories.",
        "High-protein, low-calorie foods such as tuna, turkey, egg whites, legumes, and low-fat Greek yogurt are excellent for weight loss.",
        "You can support weight loss with foods high in volume but low in calories, such as cucumbers, zucchini, spinach, broccoli, and soups.",
        "For effective weight loss, focus on lean protein, vegetables, whole grains, and avoid heavily processed foods high in sugar and fats."
      ]
    },


    {
      "tag": "foods_muscle_gain",
      "patterns": [

        "Which foods help build muscle?",
        "What should I eat to gain muscle?",
        "What foods are good for muscle growth?",
        "What foods help increase muscle mass?",
        "What should I eat to build muscle?",
        "Which foods support muscle building?",
        "What foods help muscle recovery?",
        "What should I eat to grow muscle?",
        "What foods are best for building muscle?",
        "What are good foods for bulking?",
        "How do I increase muscle mass with food?",
        "What foods give the most protein?",
        "What should I eat after lifting to build muscle?",
        "Which foods help improve muscle repair?",
        "What can I eat to help muscle gains?",
        "What are high protein foods for muscle growth?",
        "What foods help with strength training results?",
        "What foods should I eat when trying to gain muscle?",
        "How should I eat to gain muscle mass?",
        "What foods support lean muscle growth?",
        "What foods should I include in a muscle building diet?",
        "I want to build muscle, what should I eat",
        "I need foods for muscle growth",
        "I want high protein foods",
        "I need meals that help build muscle",
        "I want to increase my protein intake",
        "I want foods that improve muscle recovery",
        "I want food ideas for gaining muscle",
        "I want to grow muscle with my diet",
        "I need foods that support muscle building",
        "I want to add muscle mass with food",
        "muscle gain foods",
        "foods for muscle gain",
        "build muscle foods",
        "high protein foods",
        "muscle foods",
        "bulking foods",
        "best protein foods",
        "protein rich foods",
        "foods to grow muscle",
        "lean muscle foods",
        "muscle building diet",
        "muscle recovery foods",
        "bodybuilding foods",
        "gain muscle diet",
        "muscle mass foods",
        "protein meals",
        "protein sources"
      ],

      "responses": [
        "Foods that help build muscle include chicken breast, beef, fish, eggs, Greek yogurt, cottage cheese, beans, lentils, quinoa, and whey protein.",
        "To support muscle growth, prioritize high-protein foods such as tuna, turkey, eggs, whey protein, tofu, and lean meats.",
        "Combining protein with complex carbohydrates like oats, rice, potatoes, and whole grains helps fuel muscle growth and recovery.",
        "Eating protein-rich meals regularly throughout the day along with a slight calorie surplus is key to building muscle efficiently."
      ]
    },


    {
      "tag": "high_protein_low_calorie",
      "patterns": [

        "What foods are high in protein but low in calories?",
        "Which foods offer protein without many calories?",
        "What can I eat that is high protein and low calorie?",
        "Which low calorie foods contain a lot of protein?",
        "What foods give protein without adding too many calories?",
        "What high protein foods are good for dieting?",
        "What should I eat for high protein and low calories?",
        "What are some lean high protein foods?",
        "What foods are best for high protein with low calories?",
        "Which foods help me increase protein while staying low calorie?",
        "How can I get more protein without eating too many calories?",
        "What are light high protein food options?",
        "What foods support high protein diets without excess calories?",
        "Which high protein foods are good for weight loss?",
        "What foods help build muscle with low calories?",
        "What foods should I eat if I want protein but no extra calories?",
        "I want high protein low calorie foods",
        "I need low calorie protein options",
        "I want foods that are lean and high in protein",
        "I want protein without too many calories",
        "I want clean high protein food",
        "I need very low calorie protein foods",
        "I want cheap high protein low calorie foods",
        "I need lean protein sources",
        "I want protein foods for dieting",
        "I want foods with protein but few calories",
        "high protein low calorie",
        "low calorie protein",
        "lean protein foods",
        "protein low calorie foods",
        "low calorie high protein meals",
        "diet protein foods",
        "protein for weight loss",
        "protein without calories",
        "lean foods",
        "light protein",
        "protein sources low calorie",
        "low cal protein",
        "fit protein foods",
        "best lean protein",
        "protein options dieting",
        "protein meals low cal",
        "protein snacks low cal"
      ],

      "responses": [
        "High-protein, low-calorie foods include egg whites, tuna, cod, shrimp, turkey breast, chicken breast, tofu, low-fat Greek yogurt, and cottage cheese.",
        "Lean protein sources like Greek yogurt, egg whites, shrimp, and white fish provide excellent protein with minimal calories.",
        "Tuna, turkey breast, and cod offer very high protein per calorie, making them ideal for dieting and fat loss.",
        "Low-fat dairy, lean meats, and egg whites are strong protein options that help increase protein intake while keeping calories low."
      ]
    },


    {
      "tag": "pre_workout_meals",
      "patterns": [

        "What should I eat before a workout?",
        "What are good pre workout meals?",
        "What should I eat before training?",
        "What foods give energy before a workout?",
        "What is the best pre workout food?",
        "What should I eat before going to the gym?",
        "What foods are good before exercising?",
        "What should I eat before lifting weights?",
        "What can I eat for energy before a workout?",
        "What is a good meal before the gym?",
        "How do I fuel my workout with food?",
        "What foods help energy during workouts?",
        "What should I eat for energy for training?",
        "What should I eat before cardio?",
        "What should I eat before strength training?",
        "What do you recommend before a workout?",
        "What is a good meal before exercise?",
        "What foods are easy to digest before a workout?",
        "What small meal can I eat before training?",
        "What is the best food to eat before gym?",
        "How long before training should I eat?",
        "What should I avoid before a workout?",
        "I want pre workout meal ideas",
        "I need food ideas before working out",
        "I want something to eat before training",
        "I need a meal before the gym",
        "I want healthy pre workout foods",
        "I need energy before exercising",
        "I want to know what to eat before the gym",
        "I need help choosing a pre workout meal",
        "I want a good meal before lifting",
        "I want a light meal before my workout",
        "pre workout meal",
        "pre workout foods",
        "food before workout",
        "food before gym",
        "meal before gym",
        "pre gym meal",
        "pre workout ideas",
        "what to eat pre workout",
        "gym meal before",
        "pre exercise meal",
        "best food for pre workout",
        "good pre workout food",
        "diet before workout",
        "light meal before gym",
        "pre training food",
        "what to eat before lifting",
        "food for energy before gym"
      ],

      "responses": [
        "Good pre-workout meals include oatmeal with fruit, Greek yogurt with honey, chicken with rice, a banana with peanut butter, or a protein shake with oats. Aim for carbs plus a bit of protein.",
        "Before a workout, choose easily digestible foods like fruit, yogurt, oats, rice cakes, or a light portion of chicken and rice for consistent energy.",
        "A balanced pre-workout meal should include carbohydrates for energy and a moderate amount of protein. Examples include oatmeal, bananas, rice, yogurt, or whole-grain toast with peanut butter.",
        "If you prefer something light, fruit, rice cakes, a protein shake, or low-fat yogurt can fuel your workout without feeling heavy.",
        "Avoid heavy meals before training. Choose foods that digest easily, such as fruit, oats, yogurt, or a small lean protein portion with carbs."
      ]
    },


    {
      "tag": "post_workout_meals",
      "patterns": [

        "What should I eat after a workout?",
        "What are good post workout meals?",
        "What should I eat after training?",
        "What foods help recovery after a workout?",
        "What is the best food after the gym?",
        "What should I eat to recover after exercising?",
        "What foods rebuild muscle after workouts?",
        "What should I eat after lifting weights?",
        "What is the best post workout food?",
        "How do I recover with food after a workout?",
        "What foods help muscle recovery?",
        "What should I eat to repair muscle?",
        "What should I eat after cardio?",
        "What should I eat after strength training?",
        "What foods help refuel after workouts?",
        "What foods should I eat after exercise?",
        "What should I eat for muscle repair?",
        "What meal is good after the gym?",
        "What should I eat right after training?",
        "What foods are ideal after lifting?",
        "What should I eat after a heavy workout?",
        "How much protein should I eat after a workout?",
        "What should I avoid after training?",
        "I want post workout meal ideas",
        "I need food ideas after the gym",
        "I want something to eat after training",
        "I need a recovery meal",
        "I want good food after lifting",
        "I need meals to recover after exercising",
        "I want high protein meals after a workout",
        "I need foods for muscle recovery",
        "I want to know what to eat after the gym",
        "I want post workout food options",
        "post workout meal",
        "post workout food",
        "food after gym",
        "food after workout",
        "meal after gym",
        "after workout meal",
        "after gym food",
        "post workout protein",
        "post training meal",
        "muscle recovery meal",
        "food for recovery",
        "foods after lifting",
        "protein after workout",
        "refuel after workout",
        "post workout nutrition",
        "post exercise meal",
        "best food after workout",
        "after training food"
      ],

      "responses": [
        "Good post-workout meals include chicken breast, eggs, tuna, Greek yogurt, protein shakes, rice, potatoes, oats, and fruit. Aim for protein plus carbohydrates.",
        "After workouts, focus on protein sources like turkey, eggs, whey protein, fish, or Greek yogurt combined with carbs like rice, potatoes, or fruit.",
        "A strong post-workout meal includes high protein for muscle repair and carbs to restore energy. Examples: chicken and rice, eggs and toast, or a protein shake with fruit.",
        "Try to eat within 1–2 hours after training. Choose foods like lean meat, eggs, dairy, rice, potatoes, or oats to optimize recovery.",
        "If you cannot eat a full meal immediately, start with a protein shake, then follow with a balanced meal within a couple of hours for proper recovery."
      ]
    },

    {
      "tag": "post_workout_stretches",
      "patterns": [

        "What stretches should I do after a workout?",
        "What are good stretches after training?",
        "What should I stretch after working out?",
        "Which stretches help recovery after a workout?",
        "What are good post workout stretches?",
        "How do I stretch after exercising?",
        "What muscles should I stretch after lifting?",
        "How should I cool down after a workout?",
        "What are the best stretches after running?",
        "What are the best stretches after strength training?",
        "How do I stretch properly after exercise?",
        "What stretching routine should I follow after the gym?",
        "What helps muscles relax after working out?",
        "What stretches reduce soreness after training?",
        "What should I do to cool down after my workout?",
        "What stretching is good for recovery?",
        "How long should I stretch after working out?",
        "What is a good cool down routine?",
        "How should I stretch after cardio?",
        "What stretches help avoid injury after training?",
        "What is the best stretching routine for post workout?",
        "What stretches loosen tight muscles after exercise?",
        "What stretches should I do for muscle recovery?",
        "I want stretches for after a workout",
        "I need post workout stretching ideas",
        "I want to stretch after lifting",
        "I want a cool down routine",
        "I need stretches to help with soreness",
        "I want a stretching routine after gym",
        "I need stretches for muscle recovery",
        "I want to know how to stretch after exercise",
        "I want good stretches for after training",
        "I need help with post workout stretching",
        "post workout stretches",
        "stretches after workout",
        "post workout stretch routine",
        "stretch after gym",
        "cool down exercises",
        "cool down stretches",
        "post training stretches",
        "muscle recovery stretches",
        "stretching routine after gym",
        "stretching after lifting",
        "stretch after exercise",
        "reduce soreness stretches",
        "recovery stretching",
        "post exercise stretch",
        "best stretches after workout"
      ],

      "responses": [
        "Good post-workout stretches include hamstring stretches, quad stretches, glute stretches, chest stretches, back stretches, and shoulder stretches. Hold each stretch for 20–30 seconds.",
        "A simple post-workout routine can include hamstring stretch, quad stretch, hip flexor stretch, calf stretch, chest opener, shoulder stretch, and a gentle spinal twist.",
        "Stretching after training helps reduce stiffness. Focus on major muscle groups: legs, hips, chest, shoulders, and back. Hold each stretch without bouncing.",
        "To reduce soreness, stretch your legs, hips, back, and shoulders after training. Combine slow stretching with controlled breathing for better relaxation.",
        "A balanced cool-down includes light walking for a couple of minutes followed by static stretching for all the muscles you trained that day."
      ]
    },

    {
      "tag": "fallback",
      "patterns": [],
      "responses": [
        "I'm not sure I understood that. Could you rephrase your question?",
        "Could you clarify what you mean so I can assist you better?",
        "I wasn't able to interpret that. Please try asking in another way.",
        "I'm here to help, but I need a bit more information to understand your request.",
        "That message is unclear. Could you try stating it differently?",
        "I didn’t quite catch that. Could you explain it a bit more?",
        "It looks like I need more details to respond properly. Can you try again?",
        "I'm not certain how to respond to that. Would you mind asking differently?",
        "I couldn’t process that message. Please try again using different words.",
        "Let me know what you’re trying to find and I’ll do my best to help."
      ]
    },

    {
      "tag": "thank_you",
      "patterns": [
        "thank you",
        "thanks",
        "thanks a lot",
        "thank you so much",
        "thank you very much",
        "thanks for the help",
        "thanks for helping",
        "thank you for the information",
        "thanks for the info",
        "thank you for your assistance",
        "much appreciated",
        "i appreciate it",
        "appreciate your help",
        "that helped",
        "that was helpful",
        "you helped me",
        "thanks for the support",
        "thanks for your help",
        "really appreciate it",
        " appreciate it",
        "thx",
        "ty"
      ],
      "responses": [
        "You're welcome. I'm glad I could help.",
        "Happy to help. Let me know if you need anything else.",
        "You're welcome. Feel free to ask if you have more questions.",
        "Glad I could assist. Let me know if there's anything else you need.",
        "You're welcome. I'm here if you need more information."
      ]
    }
  ]
}